# DistributionSysType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DistributionSysType Class
Members See Also
---
Represents a specific type of distribution system.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class DistributionSysType : ElementType
```

Visual Basic
---
```text
Public Class DistributionSysType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class DistributionSysType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Electrical..::..DistributionSysType
# See Also
DistributionSysType Members
Autodesk.Revit.DB.Electrical Namespace